Retrieves the actual Element Id providing support.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public ElementId GetSupportingElement()
  Visual Basic
Public Function GetSupportingElement As ElementId
  Visual C++
public:
ElementId^ GetSupportingElement()
 Return Value
 Represents Element that provides support.
 See Also
  AnalyticalModelSupport Class
  Autodesk.Revit.DB.Structure Namespace